package com.nafanny.tasks.reference;
/*
    Все классы в Java являются объектами Object, а каждый объект является объектом какого-то класса.
 */
public class TypeClasses {

    /*
        При создании класса мы можем указать различные переменные, они называются полями или переменными экземпляров,
     но для простоты зпонимания давайте будем использовать термин "поля". Создадим пару переменных примитивного и
     ссылочного типа, пусть это будут узлы автомобиля и их колличество.
     */

    // Тут мы будем указывать количество деталей в автомобиле.
    int motor = 1;
    int transmission = 1;
    int wheel = 4;

    // У каждой детали есть название, создадим переменные и присвоим им значения (это будет название детали).
    String motors = "Мотор ";
    String transmissions = "Трансмиссия ";
    String wheels = "Колёса ";

    /*
        Теперь давайте укажем каждой детали её количество. Для этого мы будем использовать функцию System.out.println()
     и сложение строк (конкатенацию).
     Но вот какая досада, мы не можем использовать функцию System.out.println() вне метода, поэтому создадим метод.
     */

    // Как создаются и работают методы в Java мы описываем в классе TypeMethods нашего проекта.
    public void printInformation(){
        System.out.println(motors + motor);
        System.out.println(transmissions + transmission);
        System.out.println(wheels + wheel);
    }
}
/*
    Также внутри классов мы можем создавать и другие классы, но модификатор доступа будет только у главного класса.
 */
class NewTypeClasses{

    double doub1 = 12.4374854;
    String str1 = "New World";
}
