package com.nafanny.tasks.reference;
/*
    Методы в Java используются для выполнения каких-либо действий, необходимых для решения определённой задачи.
    У методов всегда есть имя, и это имя принято указывать в форме глагола, приведём пару примеров. Но логику
 */
public class TypeMethods {

    public void accelerate(){}      // Имя метода говорит нам "ускориться"
    public void decelerate(){}      // Имя метода говорит нам "замедлиться"
    public void accelerateMyCar(){} // Более длинное имя, но более понятное и конкретное.

    /*
        А если нам к примеру нужно чтобы наш метод не просто выполнял какую-то работу, но и передал результаты своей
        работы куда-то ещё. Тогда вместо слова void (дословно пустота) мы можем указать тип возвращаемого значения.
     */

    public Integer jumpCount(){return 1;}   // Тип Integer говорит нам о том что метод должен вернуть целое число.
    public String allLinesTogether(){return null;} // Тип String в методе вернёт нам строку.

}
/*
    Про модификаторы доступа рассказываем в классе AccessModifier нашего проекта.
 */