package com.nafanny.tasks;

import com.nafanny.tasks.reference.TypeClasses;

// Почему мы в качестве параметров передаём массив строк (String[] args)?
// Какие ещё параметры мы можем передать в метод main?
// Какую область видимости мы можем использовать в методе main?
// Почему используется ключевое слово static?
// Почему в качестве возвращаемого значения мы используем void?

/*
        В нашем проекте класс Main является основным классом, так как в нём у нас создан
    метод public static void main(String[] args). В Java, всегда, работа программы начинается с метода main,
    он является точкой начала работы программы, все действия которые нам нужно выполнить, на данный момент, мы будем
    описывать здесь.
 */
public class Main {
    public static void main(String[] args) {        // Описать аргументы!!!

        // Для того чтобы обратиться к объекту, нам необходимо создать объект этого класса.
        TypeClasses auto = new TypeClasses();

        // У созданного объекта auto есть возможность обращаться к его полям и методам.
        auto.printInformation();
    }
}


// LocalDate
// уровни абстракции в проекте