package com.nafanny.tasks.primitive;

public class FloatingPointNumbers {

    // Начнём с объявления переменных и их инициализации.
    float fl;   // Объявляем переменную fl (то-есть выделяем область в памяти) но не инициализируем её.
    float fl1 = 1.1F;   // Обратите внимание при инициализации нам явно нужно указать на тип float поставив в конце F.

    double doub;    // Объявляем переменную doub (то-есть выделяем область в памяти) но не инициализируем её.
    double doub1 = 2.2; // По умолчанию все переменные указываются как тип double, поэтому тут не нужно писать D в конце.

}
